{
  "doi": "https://doi.org/10.5278/ijsepm.5400",
  "affiliations": [],
  "title": {
    "text": "Application of a cost-benefit model to evaluate the investment viability of the small-scale cogeneration systems in the Portuguese context",
    "entities": [
      {
        "raw_entity": "Portuguese",
        "role": "Object of study",
        "osm_entity": "Portugal",
        "osm_link": "https://www.openstreetmap.org/relation/295480",
        "osm_id": "295480",
        "place_id": "263154752"
      }
    ]
  },
  "abstract": {
    "text": "Increasingly, modern society is dependent on energy to thrive. Remarkable attention is being drawn to high energy-efficient conversion systems such as cogeneration. Energy sustainability depends on the rational use of energy, fulfilling the demands without compromising the future of energy supply. The market trends foresee the use of decentralized production and the increasing replacement of conventional systems by small-scale cogeneration units as solutions to meet the energy needs of the building sector. Analysing the influence of the variables that determine the economic viability of decentralized energy production systems has become more important given the scenario of energy dependence and high energy costs for the final consumer. A Cost-Benefit Analysis (CBA) was developed and presented to identify the potential of small commercial scale cogeneration systems in the Portuguese building sector, based on cost-benefit analysis methodology. Five case-scenarios were analysed based on commercial models, using different technologies such as internal combustion engines, gas turbines and Stirling engines. A positive value of CBA analysis was obtained for all the tested cases, however, the use of classic economic evaluation criteria such as the net present value, internal rate of return and payback period results led to different investment decisions. According to the results, the gas turbine has the best result of the CBA analysis in terms of annual profit (23 883 €/year), whereas, the SenerTec GmbH motor engine is the system with the highest specific profit (477.1 €/kW el ). For all the tested cases, the costs of the system operation exceed the profit from selling the generated electricity. Without accounting for the avoided costs and societal benefits, the CBA results would disclose unprofitable cogeneration systems. The model also highlights the influence of energy prices in the economic viability of these energy power plants. The inclusion of subsidized tariffs for efficient energy production is the most contributing aspect in the analysis of the economic viability of small-scale cogeneration systems in the Portuguese building sector. Only in that case, it would be possible for an investor to recover the capital costs of such technology, even if the technical and societal benefits are accounted for.",
    "entities": [
      {
        "raw_entity": "Portuguese",
        "role": "Object of study",
        "osm_entity": "Portugal",
        "osm_link": "https://www.openstreetmap.org/relation/295480",
        "osm_id": "295480",
        "place_id": "263154752"
      }
    ]
  },
  "fulltext": [
    {
      "section_num": "1.",
      "section_name": "Introduction",
      "text": "There is a close relationship between the economic growth and energy usage, which cannot be properly studied without considering different energy sources and its consumption by activity sector [1,2].Early in 2014, the European Commission presented a report on energy prices and costs, as well as an extensive impact assessment.The report evaluated the main drivers of energy costs, by comparing the EU prices with those of its main trading partners.It was concluded that the economic recession has negatively influenced the investment activity in the development of integrated flexible markets and efficient energy systems that required for more rational and efficient use of energy in every sector of economic activity [3].The lack of investment led to a need for reform in the energy sector to adapt large power plants to the requirements of EU directives, which include solutions for district heating [4]. The reduced investment has been even more unsuccessful in the building sector, an aspect that difficult and delays the energy transition process in one of the sectors that most final energy consumes.The lack of investment affects the energy transitions process at the national and local level because of the policy structures which are difficult to assess and predict [5].A deeper insight on solutions for existing buildings is crucial because of the limited adaptability of infrastructures to overcome the technical challenges for improving energy performance in buildings [6].",
      "entities": []
    },
    {
      "section_num": "1.1.",
      "section_name": "Roadmap of cogeneration background over the years",
      "text": "Cogeneration, also known as Combined Heat and Power (CHP), is not a new concept.Industrial plants led to the concept of cogeneration back in the 1880s, when steam was the primary energy carrier in the industry.Then, the construction of large scale electric power plants and the implementation of distribution grids led to the reduction in the electricity cost, and the industries began buying electricity and discontinuing their energy production.This resulted in the reduction of cogeneration power plants in the industrial sector.Also, the regulatory policies regarding electricity generation, lower fuel prices and advances in technology (e.g. products like packaged boilers) led to the decline of cogeneration in the first half of twentieth-century in Europe [7].This downward trend started to revert in 1973, after the first fuel crisis.Back then, high efficient power plants and systems able to run with alternative energy resources started to receive considerable attention, mainly because of the energy costs and the uncertainty in fossil fuel supply [2,8,9]. In the second half of the 20 th century, most electricity generated came from coal-fired boilers and steam turbine generators and the heat from these thermal systems was used for industrial applications (i.e.driven by thermal demand).Based on that, several governments, especially in Europe, United States, Canada and Japan have implemented a few initiatives to establish and/or promote the use of cogeneration applications not only in the industrial appliances but also in emerging sectors with increasing potential of energy consumption, such as the building sector [10]. In 2004, the European Union published the Directive on the promotion of cogeneration based on the useful heat demand in the energy market, the Directive 2004/8/EC [11].This directive aimed the promotion of high-efficiency systems led by consumer heat demand profiles and stated that all the generated energy produced from the cogeneration should be used to reach, at least, 75% of overall efficiency.It also established the definition of high-efficiency cogeneration systems as those able to provide a Primary Energy Savings (PES) of at least 10% for units larger than 1 MW el , when compared to the reference values for the separate production of heat and electricity.For units smaller than 1 MW el , the system is classified as high-efficiency if a positive value of PES is obtained [12].Years later, the European Commission established harmonized efficiency reference values for the separate production of electricity and heat, the Decision 2011/877/EU.The calculation of harmonized efficiency reference values took into account factors such as the fuel type and year of construction, local climate and the avoided grid losses [13].The successive EU legislation was brought to the Portuguese national legislation over the years, establishing the technical and remuneration conditions for the CHP systems operation.",
      "entities": [
        {
          "raw_entity": "Europe",
          "role": "Other",
          "osm_entity": "Europe",
          "osm_link": "https://www.openstreetmap.org/node/25871341",
          "osm_id": "25871341",
          "place_id": "124411950"
        },
        {
          "raw_entity": "United States",
          "role": "Other",
          "osm_entity": "United States",
          "osm_link": "https://www.openstreetmap.org/relation/148838",
          "osm_id": "148838",
          "place_id": "46985635"
        },
        {
          "raw_entity": "Canada",
          "role": "Other",
          "osm_entity": "Canada",
          "osm_link": "https://www.openstreetmap.org/relation/1428125",
          "osm_id": "1428125",
          "place_id": "346277167"
        },
        {
          "raw_entity": "Japan",
          "role": "Other",
          "osm_entity": "Japan",
          "osm_link": "https://www.openstreetmap.org/relation/382313",
          "osm_id": "382313",
          "place_id": "242384397"
        }
      ]
    },
    {
      "section_num": "1.2.",
      "section_name": "Brief review on technologies and applications",
      "text": "Concerning the building sector, the applications for cogeneration include hospitals, office buildings and single-and multi-family residential dwellings.In the specific case of single-family buildings, the capacity and the size of CHP systems depend on technical challenges to suppress the thermal and electrical load needs [14].In such cases, electrical/thermal storage, as well as connections to inject surplus energy into the distribution grid, are required [15] Several cogeneration technologies are available in the market for single-family (<10 kW el ) and multi-family (10-50 kW el ) applications [16].In this range of application, the technologies suitable for cogeneration systems are microturbines [17,18], Internal Combustion Engines (ICEs) [19] fuel cell-based cogeneration systems, Organic Rankine Cycles (ORCs) [20,21] and reciprocating external combustion Stirling engine [22,23]. Microturbine designs include an internal regenerator to reduce fuel consumption, thereby substantially increasing efficiency [24].In cogeneration mode, the overall efficiencies of the micro-turbines, as claimed by manufacturers can be in the range of 75-85% [25,26].The total investment costs for micro-turbine-based CHP applications are estimated to vary from 1 000 to 1 700 EUR/kWel.For instance, Capstone® commercializes different sizes of micro-turbines: 30 kW, 65 kW, and 200 kW, which can be used in distributed power generation and most of them operate on NG [27]. ICEs are more suitable for large-scale cogeneration, mostly running on diesel or oil.They can also operate on a dual fuel mode that burns primarily NG with a small amount of diesel fuel [28].Fuel cell technology is a technology with the potential for both electric and thermal power generation.The advantages of fuel cells include low noise level, low maintenance, low emissions, and a potential to achieve high overall efficiency even with small units.When compared with ICE, a fuel cell allows a reduction in gas emissions: the carbon dioxide emissions may be reduced up to 49%, nitrogen oxide (NOx) emissions by 91%, carbon monoxide by 68% and volatile organic compounds by 93% [29,30] Low emissions and noise levels make fuel cells particularly suitable for residential and small commercial applications.ORCs are also a technology that has proved to be suitable for low-temperature heat source applications at various scales, from several kW el to over 1 MWel.By using low-temperature heat sources, the ORC has relatively higher exergetic efficiency when compared to other heat cycles [21,31]. Stirling engines rely on external combustion or other exterior heat source, thus allowing the use of different primary energy sources including fossil fuels (oil derived or NG) and renewable energies (e.g.solar or biomass) [32,33].Xiao et al. [34] have studied the most technological challenges of applying Stirling engines to cogenerations, whereas Balcombe et al. [35] are more focused on its integration with photovoltaic panel, considering energy storage through the use of batteries.Nevertheless, the most recent studies are focused on the use of renewable energy sources, such as solar energy [36,37], which intermittency problems affects their viability.Stirling engines have been developed for a wide range of power capacity (from 1 W to 1 000 W) and with a great potential for combined heat and power systems [38,39]. A strategic approach is needed to adequately embed new technology, investment and operation practices [40,41].Pilavachi et al. [42] defend that the development, construction and operation of small and micro-CHP systems must be evaluated according to economic, social and environmental aspects in an integrated way and the results of the evaluation should be compared by means of the sustainability scores.Ferreira et al. [24] presented an optimisation model to simulate a smallscale cogeneration system based on micro-gas turbine technology, for a building application, considering a cost-benefit analysis.Authors had concluded that smallscale systems applied to the building sector mostly depends on fuel and electricity Feed-In-Tariffs (FIT's), even for mature technologies such as gas turbines. Huangfu et al. [43] presented a study in which an analysis of a micro-scale combined cooling, heating and power system was performed.The economic efficiency of the system is discussed in terms of different criteria: payback period, initial costs, annual savings and profits, operating cost, calculation of the interest rate, payback time and net present value.Buchele et al. [44] developed a comprehensive study to evaluate the potential for high-efficient cogeneration and the viability of District Heating and Cooling (DHC) in different regions of Austria.The study was based on de calculation of trade-offs between network costs, industrial waste heat integration and investment planning at individual regions to determine the suitability of CHP or DHC utility.Gvozdenac et al. [9] proposed a modified method for verifying the cogeneration efficiency depending on type, technology, operating conditions and lifetime. The economic viability of a cogeneration plants depends on the development of a system at a cost that can be recovered from the savings and incomes during its useful lifetime.The financial analysis depends on both the capital investment and the value of electricity produced, which represents the most valuable income from the system's operation [14].For any given system, the payback relies on the unit's operating hours and consequently the total electricity produced annually.Thus, it is not only the system purchase costs that are important to calculate.The installation and maintenance service over the system-working lifetime have to be quantified [14]. This aspect is emphasised by Odgaard and Djørup [45] who defends that distinct price regulation regimes should be defined for DHC because those systems differs from electricity supply or natural gas supply.A counterbalance is required since the individual producers can opt in or out as suppliers of electricity to a large grid, which can be interlinked on a regional or even national scale. Several approaches are been applied in the literature to evaluate the economic viability of energy systems [46].Biezma and Cristobal [47], in their study, review the main investment criteria typically used to select cogeneration power plants.These criteria include the net present value and the payback period.Cardona et al. [48] have studied the importance of cogeneration supporting policies in matching customer's requirements for the reduction of environmental impacts while maximizing profit or energy savings.Li et al [49] developed a similar analysis but applied to cogeneration heating systems with waste recovery heat.Authors concluded that the use of heat can reduce costs and the use of electrical appliances to satisfy heating needs in buildings.The Cost-Benefit Analysis (CBA) is one of the most applied methodologies which according to Polatidis et al. [50] imposes a compensation between different criteria: \"a good performance of an action to one criterion can offset a relatively bad performance on some other criteria\". The concept that buildings should become energy producers to suppress their energy requirements also contributes to meet the environmental targets: high primary energy savings and the substantial reductions in CO 2 [51].It is undeniable the intention to reduce the energy dependence on fossil sources, mainly if that potential could be associated with high-efficient energy conversion systems.However, it is important to embrace a few challenges that small-scale systems have yet to overtake to achieve market dissemination.The most important is, in fact, the higher investment cost of these systems [52].These energy plants must be manufactured at a cost that can be recovered from the savings in operating costs [53,54].Considering the capital costs for these power systems, they represent the main barrier for the success of cogeneration systems dissemination in the energy markets [55,56]. The conventional cogeneration systems contribute to the reduction of greenhouse gases emissions, by offering efficient energy conversion.As previously reported, the cogeneration overall efficiencies based upon both the thermal and electrical energy production can reach a plateau between 80%-90% [57].Since combined heat and power plants include the production of both electricity and thermal energy (i.e. in the form of hot water or steam), the efficiency of energy production can be increased when compared to the conventional energy generation (e.g. a conventional boiler to produce thermal energy and electricity acquisition form the distribution grid) [49,53].All this technological, economic and environmental aspects justifies the study of cogeneration systems applied to residential buildings and the identification of its potential. This paper presents a cost-benefit model to identify the potential of small scale cogeneration systems for the Portuguese building sector (including residential and service/commercial buildings), considering a comparative overview of the costs and benefits.The model is applied to several systems driven by different technologies such as ICEs, gas turbines or even Stirling engines for any electrical and thermal output.Economic indicators such as the Net Present Value (NPV), Internal Rate of Return (IRR) or the Payback Period (PP) were estimated for each system.Also, it is presented the evolution of legislation applicable to cogeneration systems and it is shown how the implementation of cogeneration systems has been restricted through the reduction of selling electricity tariffs, especially for systems based on non-renewable energy.",
      "entities": []
    },
    {
      "section_num": "2.",
      "section_name": "Potential of the Cogeneration in the Portuguese Context",
      "text": "In Portugal, until 1990, the market penetration rate for cogeneration was reduced and the installed capacity (a total of 530 MW el ) was distributed by several subsectors of the industry [58].More recently, according to data from DGEG -Portuguese administrative authority for the coordination of Energy and Geology, the cogeneration has benefited from political incentives through the FIT's.With this remuneration system, the government intended to promote the self-production of electricity and the sale of energy surplus.Several improvements were reached over the years concerning the connection of cogeneration power stations.In the late 90s, the number of cogeneration projects increased with the introduction of Natural Gas (NG). The installed capacity in cogeneration has grown at an average rate of 118 MW/year since 2007, reaching a total of 1 915 MW in 2013.Since 2014, the absence of new plants to replace the decommissioned ones, resulted in the reduction of an installed capacity to 1 457 MW in 2019.Figure 1 presents the evolution of CHP installed capacity and primary energy savings from CHP between 2007 and 2019 in Portugal [59]. Regarding the annual electricity production from cogeneration, by the year of 2018, the active cogeneration plants in Portugal produced about 5 900 GWh of electricity (corresponding to a total of 110 cogeneration plants), but in 2019 there was a slight decrease of about 35 GWh compared to the previous year.The overall efficiency reached a value of 79% with an average number of working hours of about 4 349 h [59].Due to the high global efficiency of cogeneration systems, the annual variation in their installed capacity and the annual variation in electricity production has a direct impact on Portugal primary energy imports [59,60].As a consequence, the installed output has declined due to the absence of newly installed systems to replace the decommissioned power plants [61]. Applying the efficiency reference values from the directive Directive (2011/877/EU), as well as the network losses due to the location's voltage level, these numbers represent a primary energy saving of 33.5% [61].Statistics evidence that in the services building sector, energy consumption is dominated by electricity, at approximately 73%, while the consumption of thermal energy corresponds to 27% [48].The relatively mild winter season where most services buildings are located and concentrated (littoral coast cities), the reduced number of hours during which heating is required and the significant use of electric air-conditioning systems are the main reasons of the reduced demand for heating in buildings [48]. The applications that are most likely to enable cogeneration systems in the services sector are the healthcare buildings since hospitals have constant requirements of heat and cooling.Usually, the cooling generation is based on the residual heat from electricity production, making the cogeneration units viable by ensuring the use of heat for a sufficient period of time.In that way, the cogeneration units became energetically more efficient and justify the economic investment.However, it is necessary to compare those units with equipment only using compressed-air energy (i.e., a turbine that generates electricity from a flow of high pressure air), which has lower investment costs due to technology maturity.Otherwise, it is not guaranteed that the primary energy savings provided by cogeneration systems justify economic incentives and policy support schemes [62]. Regarding the residential building sector, the climatic conditions coupled with the economic situation of the households result in a consumption that is currently too small to allow any viability of the installation of individual units.The highest current consumption densities, obtained only for some urban areas in the cities of Lisbon and Porto, are much lower than the reference density for the European Directive (130 kWh/m 2 ) [63] Thus, and despite the forecast of a 5.6% increase in consumption for heating and cooling, this feasibility is not expected to be achieved even in 2025 [16].In the residential sector, the investment costs rise substantially with the reduction of the installed capacity of the systems.There is also a marked improvement of the housing thermal envelope, which reduces, even more, the heating requirements. Based on the projections from the reference scenario 2016 [64], the estimative for energy consumption is presented in Table 1.The projected increase in consumption for the residential sector will be essentially justified by the consumption of NG and other sources (possibly biofuels and solar energy) in the use of domestic appliances and illumination.In the services sector, it is expected a reduction in the consumption of electricity for air-conditioning, which is counteracted by the increase in consumption in electric equipment and lighting [16,65]. According to data from DGEG [58], a few recommendations have been addressed in the Portuguese context to enhance the use of these efficient and environmentally friendly technologies such as cogeneration: (1) Reduce the complexity and increase the transparency concerning the authorisation, connection and claims processes of developing a cogeneration project and of operating a cogeneration project, thus making the business proposition more attractive.(2) Create an integrated approach for European legislative initiatives to ensure a balanced policy framework recognizing the value of distributed energy production as an important factor for achieving European policy goals.(3) Develop policies that should guarantee increased market value of non-fossil sources, i.e. taxation of heat that is deliberately wasted, and/or bonus/ incentive systems for heat recycling.Such policy strategies need to acknowledge regional specificities and variances concerning the availability and opportunity of using renewable and cleaner energy sources.(4) Ensure the tariff regulation, particularly for social reasons and to provide long-term stability to potential investors [66].Additionally, other support measures can be used to promote the CHP technologies from a practical point of view, such as low-interest loans provided for investments with CHP equipment or develop a program for the promotion of CHP facility to supply the energy needs in remote areas by providing investment support (a percentage) of the total installation costs [62].",
      "entities": [
        {
          "raw_entity": "Portugal",
          "role": "Other",
          "osm_entity": "Portugal",
          "osm_link": "https://www.openstreetmap.org/relation/295480",
          "osm_id": "295480",
          "place_id": "263154752"
        }
      ]
    },
    {
      "section_num": "3.",
      "section_name": "Policy and framework of the cogeneration activity in Portugal over the years",
      "text": "In this section, a brief review of the resolution laws that regulate the cogeneration activity is presented.In Portugal, the cogeneration Directive (2004/8/EC) was only transposed into national legislation in 2010 through the publication of Decree-Law n. º 23/2010 [67].By the year of 2015, the cogeneration activity in Portugal was substantially modified with the publication of Decree-Law n. o 68-A/2015 and for that reason, this legal framework became more restrictive regarding CHP economic feasibility [62].Figure 2 provides a summary of the legislation for cogeneration activity in EU and Portugal over the last two decades and their chronological sequence.The Decree-Law nº 538/99 reviewed the regulatory framework applicable to the production of electricity from cogeneration facilities and two years later, the Decree-Law n.º 313/2001 provided its amendment regarding the regulations on operating conditions and tariffs for combined heat and power generation activities. As previously stated, in 2004, the Directive 2004/8/EC was published regulating the cogeneration activity, which was only transposed into national legislation in 2010 through the publication of Decree-Law n.º23/2010.In this, some relevant considerations emerged; pointing out that the promotion of high-efficiency cogeneration should be based on the useful heat demand.Nevertheless, it was duly complemented by the publication of several laws: (1) Regulation nº140/2012 specified the remuneration regime for cogeneration production, stipulating the terms of the reference tariff, its depreciation, the calculation of the efficiency and renewable energy premium.Table 2 presents several specificities of the Decree-Law n.º 23/2010 and Decree-Law n.º 68-A/2015 implementation.Under the Decree-Law n.º 23/2010, the efficiency bonus, the market share premium and the reference tariff are only applicable for 120 months after the beginning of the operation.With the introduction of the Decree-Law n.º 68-A/2015, the general scheme was divided into two submodalities, one dedicated to self-consumption [14,15]. Regarding the Decree-Law n.º 23/2010, the electricity selling tariff ( sell p ) is calculated by adding the electric- ity market price ( MP ) to the market participation pre- mium ( efect MPP ), as defined by equation (1).",
      "entities": [
        {
          "raw_entity": "Portugal",
          "role": "Other",
          "osm_entity": "Portugal",
          "osm_link": "https://www.openstreetmap.org/relation/295480",
          "osm_id": "295480",
          "place_id": "263154752"
        }
      ]
    },
    {
      "section_num": null,
      "section_name": "p MP MPP sell effect",
      "text": "(1) (2) MP -electricity market price; (3) TMPP -theory market participation premium. The MPP efect value is calculated as a function of mathematical conditions, which are limited to a minimum and maximum value of the electricity selling tariff.For instance, if the sum of MP and TMPP values vary between 0.8T ref and 1.3T ref , the MPP efect value corresponds to 50% of the reference tariff (T ref ).All the conditions applied to this remuneration scheme are presented at the equation (2).However, for highly efficient CHP systems, an efficiency bonus is calculated according to the PES of each cogeneration plant, whereas for systems using renewable energy sources, a premium is also attributed, depending on the proportion of consumed renewable fuel.For the special scheme, the remuneration of thermal energy is applied according to the market conditions and the electricity should be delivered and sold to the grid at reference tariff. Regarding the Decree-Law n.º 68-A/2015, the electricity remuneration of the general scheme (Modality B) corresponds to the product between the market electricity price and the amount of electricity that is sold to the grid, not being provided with the payment of any premium/bonus.Only for the special scheme, a bonus to those systems with higher efficiency or using renewable energy sources is applied.Nonetheless, even for those circumstances, a maximum limit of 7.5€/MWh was defined [14,15].",
      "entities": []
    },
    {
      "section_num": "4.",
      "section_name": "Development of the cost-benefit model",
      "text": "In this section, the methodology implemented in this work is presented, as well as the definition of all the assumptions for the model formulation.The cost-benefit model was applied to five specific cases of cogeneration systems, which technical specifications are also presented.",
      "entities": []
    },
    {
      "section_num": "4.1.",
      "section_name": "Methodology",
      "text": "A CBA methodology is based on three phases, which represent the essential steps in its implementation (Figure 3).These steps correspond to technical analysis and an economic/financial analysis.The initial phase corresponds to the component in which the context and technical characteristics of the project are identified.In the financial analysis, all the data are collected to construct tables for analysis of cash flows (selection of Applicable to all the cogeneration systems, being mandatory for installations with an installed capacity higher than 100 MWel. Applicable to all the cogeneration systems with an installed capacity below 100 MWel. Remuneration of electricity and thermal energy is carried out under market conditions (reference tariffs). The remuneration of thermal energy is applied according to the market conditions and the electricity should be delivered and sold to the grid at reference tariff. A market share premium defined as a percentage of the reference tariff for installations with a capacity below or equal to 100 MWel is applicable. • An efficiency bonus, calculated according to the PES of each cogeneration plant.• A renewable energy premium, depending on the proportion of consumed renewable fuel.",
      "entities": []
    },
    {
      "section_num": null,
      "section_name": "Decree-Law n.º 68-A/2015",
      "text": "Modality A Modality B Applicable to all the cogeneration systems with an installed capacity equal or below 20 MWel. Applicable to cogeneration systems with an installed capacity equal or bellow to 20 MWel operating in self-consumption only. Applicable to cogeneration systems where the total and/ or part of the electricity is sold. • An efficiency bonus, calculated according to the PES of each cogeneration plant.• A renewable energy premium, depending on the proportion of consumed renewable fuel.Maximum limit of the bonuses: 7.5 €/MWh the most important cost and revenues); access the sustainability analysis (where the term 'sustainability' recognizes future generations' rights in the calculation of benefits and costs), and evaluate the financial benefits by calculating profitability from the private investor's point of view (financial return on the project).The financial analysis is performed based on the cash flow method.Choosing the discount rate is crucial for assessing weighted costs compared with benefits over an extended period.In this case, this period corresponds to the estimated technical lifetime of the cogeneration systems [69].When calculating the balance between revenue and expenditure, the accumulated liquidity is obtained.Commonly, the criteria include: (1) Investment costs and residual value: includes the value of fixed assets and residual value, which appears as a single positive entry in the last year of the time horizon; (2) Operating costs and revenues: includes all operational costs and possible revenue items; (3) Tariffs: applies the prices and market tariffs that can be used in the model.When assessing the feasibility of a project, the externalities generated must be considered.Externalities consist of social costs or benefits that influence the social well-being without direct monetary return.The effects of externalities have to be quantified and then converted into monetary units so that they can be included in the analysis.Ultimately, the evaluation of the profitability of projects can be carried out using classic investment analysis criteria. These criteria include the net present value, the internal rate of return and the payback of the investment [70].",
      "entities": []
    },
    {
      "section_num": "4.2.",
      "section_name": "Model considerations and assumptions",
      "text": "As previously stated, the national Decree-Law n.º 68-A/2015 came to amend the Decree-Law nº23/2010 establishing the rules of the cogeneration activity, enshrining the paradigm assumed by the European Directive 2012/27/EU and defining a sustainable remuneration scheme.The general remuneration scheme is divided into two modalities: (1) facilities working in a self-consumption mode, benefiting of guaranteed purchase of the surplus energy for installations of cogeneration with electric power inferior or equal to 20 MW; (2) installations aiming to sell the total or part of the energy produced.The installations working on self-consumption mode and connected to the public grid are subject to the payment of a monthly fixed compensation in the first 10 years after obtaining the operation permit.The efficiency reward is applied only to the high efficient CHP units (PES> 10%).The Modality B from the \"General Scheme\" of Decree-Law n.º 68-A/2015 was chosen because it is the legislation currently in force.This modality foresees the hypothesis of commercializing all electricity production in organized electricity markets.The first step of the calculus methodology is to know the amount of electricity that is produced and sold and the correspondent market electricity price.The market prices can be obtained from the Portuguese National Electrical Grid (REN) database.",
      "entities": []
    },
    {
      "section_num": "4.3.",
      "section_name": "Model formulation",
      "text": "The definition of the cost-benefit model is based on the balance between the benefits and the costs associated with the investment and operation of high-efficiency cogeneration systems for the small-scale application.The balance between the benefits (B) and the costs (C) results in the CBA function as in equation ( 3). Among the benefits, the model comprises the revenues from selling the electricity (B E,Sell ), the savings generated from the avoided cost of heat production are accounted for (B Q,avoided ) and the societal benefits (B societal ).The societal gains have been converted into monetary value, by quantifying the benefits provided by the primary energy economy which, in large part, reflects the reduced import of fossil resources, the reduction of associated CO 2 emissions and the distribution losses [72].Amongst the costs, the model accounts for the costs of the energy consumed by the cogeneration unit (C E,consumed ), as well as, the operational and maintenance costs (C o&m ).The terms of the CBA function are determined in terms of annual costs (€/year), to define the cash flows of the economic analysis for each case study to which the model is applied.",
      "entities": []
    },
    {
      "section_num": "4.3.1",
      "section_name": "Benefits (B)",
      "text": "Some simplifications are assumed when calculating the revenues from selling the electricity: (1) all the electricity produced by the cogeneration is sold (general scheme), so there is no self-consumption of electricity; (2) price of electricity, P sell , was estimated, considering the typology of the cogeneration unit and the remuneration scheme in €/kWh.The electricity produced, E (in kW) is estimated considering the installed capacity of the system and the number of operating hours.In Portugal, on average, most of the cogeneration units have approximately 4500 working hours.Thus, the annual revenue from electricity selling, B E,Sell , is determined by equation ( 4).Since a single system produces both electricity and useful heat, additional equipment (e.g. a boiler) to produce the required heat is avoided.The heat is used to suppress the domestic hot water or space heating needs.This results in an avoided cost (savings) that can be determined as a function of the heat produced by the system, B Q,avoided , expressed by equation ( 5): where Q corresponds to the useful thermal energy produced by cogeneration, P comb is the unit price of the fuel used by the unit in €/kWh.For systems working on cogeneration mode, the heat produced must be estimated, based on the heat-to-power ratio, λ , characteris- tic of each type of technology ( Q E λ = ⋅ ).The number of cogeneration operation hours will be assumed (t = 4500 hours).This value was based on a preliminary study through the determination of the thermal power duration curve for a reference multi-apartment building [53].The building was classified as energy class B minus by RCCTE (Portuguese Regulation of Thermal Behaviour Characteristics of Buildings), located in the city of Oporto, north of Portugal.This heating demand mostly depends on the heating degree days of the local climate.In the Oporto city the heating season duration is of about 6.7 months, corresponding to 1 610 ºC heating degree days [73].Thus, the total thermal power duration curve was obtained from the sum of the hourly hot water needs (40 L per person and per day at 335 K and an occupation of four persons per dwelling), plus the hourly heating load (the amount of useful energy required to keep the building at a reference temperature of (295 K) during the heating season). The societal benefit is defined as a function of PES.The societal benefits, B societal , included in this model are related to the \"energy and resource management\" typology, which are concerned with the preservation and issues related to energetic sources and their sustainability.PES represents the savings of primary energy ( ) ) Ana C. Ferreira, Senhorinha F. Teixeira, José C. Teixeira and Silvia A. Nebra resources avoided when combining the production of heat and power [11] according to the equation ( 6): where ɳ e,ref and ɳ t,ref correspond to the electric and thermal reference efficiencies of the conventional energy production, and ɳ t,CHP correspond to the electric and thermal efficiency of the cogeneration system.Thus, the societal benefit is determined by the equation ( 7): where the reference electric efficiency corresponds to ɳ e,ref = 52.5% based on the conventional power plant and the thermal efficiency corresponds to ɳ t,ref = 90%, assuming a conventional boiler for the production of heat [13].",
      "entities": [
        {
          "raw_entity": "Portugal",
          "role": "Other",
          "osm_entity": "Portugal",
          "osm_link": "https://www.openstreetmap.org/relation/295480",
          "osm_id": "295480",
          "place_id": "263154752"
        },
        {
          "raw_entity": "Oporto",
          "role": "Other",
          "osm_entity": "Oporto",
          "osm_link": "https://www.openstreetmap.org/relation/3372453",
          "osm_id": "3372453",
          "place_id": "263705801"
        }
      ]
    },
    {
      "section_num": "4.3.2",
      "section_name": "Costs (C)",
      "text": "The costs of the consumed energy by cogeneration unit, C E,consumed , can be determined based on the primary energy saving of the system as in equation (8). The operation and maintenance costs, C o&m , of the cogeneration system can be quantified in a generic way as a percentage of the investment costs, or a specific cost depending on the number of operating hours for a specific technology.These costs are determined according to a fixed economic value for the system under study as in equation ( 9).The term P o&M is the specific maintenance price of each system (€/kWh).",
      "entities": []
    },
    {
      "section_num": "4.4.",
      "section_name": "Different case scenarios for model validation",
      "text": "The model developed was applied to five specific cases of cogeneration systems, three systems using combustion engines (Case 1, Case 3 and Case 4), a smaller system using a V-2 Stirling engine (Case 2), and a system running a gas turbine (Case 5), corresponding to the system with the highest installed capacity.The use of these cogeneration systems based on fossil fuels, is grounded on two main aspects: (1) Being the most cost-effective solution regarding the market availability; (2) Having the lowest capital costs.Table 3 generically presents the specifications to apply the developed model in the five case scenarios. Cogeneration systems using internal combustion engines have lower capital costs than gas turbine systems.This difference is often related to the maturity of the technology and the technical complexity of these systems.Although both technologies are in a high degree of maturity, aspects such as the estimated lifetime or the number of replaceable components turn out to be determinant in their cost of production and therefore in their cost of investment.The Stirling engine is a technology suitable for residential/ lower scale applications, but it has higher specific costs. , , , , Application of a cost-benefit model to evaluate the investment viability of the small-scale cogeneration systems in the Portuguese context",
      "entities": []
    },
    {
      "section_num": "5.",
      "section_name": "Results and discussion",
      "text": "In this section, the main results from the CBA analysis applied to different commercial models available in the market are performed.In addition, a sensitivity analysis is presented, based on the impact of system operating hours, electricity and NG prices in the NPV.",
      "entities": []
    },
    {
      "section_num": "5.1.",
      "section_name": "Economic and environmental results",
      "text": "Table 4 presents the results from applying the CBA model to the five case scenarios of different technologies with different power productions.The possibility of selling electricity represents a major income from the system's operation.The cogeneration units that sell all or part of the electricity generated in organised markets are framed in the rules applicable to the producers of electrical power in general.Cogeneration units using combustible fuels with an emissions coefficient equal to or smaller than NG have the same priority for electricity network connection as the systems using renewable sources.For all the tested cases, the costs of the system operation exceed the profit from selling the generated electricity.The avoided costs from not having a separate system to produce the thermal needs (for example a conventional boiler) represent an important benefit in the CBA model.This outcome is highly dependent on the applied tariffs, namely the price of electricity and the price of fuel, which are decisive factors in the costbenefit model.The inclusion of subsidized tariffs for efficient energy production is the most relevant aspect in the analysis of the economic viability of small-scale cogeneration systems.According to the results, the gas turbine (Case 5) has the best result of the CBA analysis in terms of annual profit (23 883 €/year).Nevertheless, the SenerTec GmbH motor engine (Case 3) is the cogeneration system with the highest value in terms of specific profit (477.1 €/kW el ). The societal benefit increases with the size of the system since it has been defined as a function of the primary energy savings.One of the main problems related to the economic viability of these systems is the monetization of the social and environmental benefits of their implementation.There are multiple societal benefits in environmental, economic and macroeconomic terms: the reduction of CO 2 emissions of high-efficiency systems when compared to conventional energy production; self-sufficiency in terms of energy production and empowerment of the final consumer as a consumerproducer. In macroeconomic terms, the social benefits included the reduction of energy dependence on fossil fuels (due to PES increase), the reduction of imports of these same fuels and the reduction of network distribution costs.It is important to induce for example carbon tax or emission allowances so that the less environmentally friendly systems pay more.Therefore, it is essential to carry out an economic analysis considering the initial investment of the system acquisition and its installation, as well as, a certain market and the lifetime of this project and economic criteria such as NPV, IRR and PP. To do so, the systems investment costs from Table 3, C inv , has to be annualized to assess the impact of the system lifetime, n, by determining the investment capital recovery factor (CRF) as in equation (10). The CRF compares monetary flows using an interest rate that evaluates how money value varies over time.By incurring an expense today, the investor expects to be e n e i i CRF i Table 5 presents the results for the economic criteria for each test case.Considering NPV as the investment criterion, only Case 2 and Case 3 are viable systems, since its positive value represent a measure of profit calculated by subtracting the present cash outflows (investment cost) from the present values of cash inflows over the system lifetime. The IRR is the rate that equates the present value of a project's cash outflow with the present value of its cash inflow, in other words, that interest rate for which the present value of a project is equal to zero.An IRR above the interest rate, i e , reflects a more attractive investment (Case 2 and Case 3).Concerning the PP (a simple payback time), in Case 4 it is not possible to recover the initial investment during the estimated system lifetime period, while in Cases 2 and 3, it is possible to recover the investment in less than half of the system lifetime. Cogeneration reduces the amount of primary energy used to produce the same energy output when compared with the conventional (separate) production and, as a consequence, the carbon emissions can also be reduced.The most common fuel used by cogeneration systems is still NG.For those systems, the primary energy and the carbon emissions savings are mainly due to the high efficiency of those systems in the energy conversion process. The equivalent CO 2 avoided emissions can be calculated to estimate the reduction of gas emissions from using cogeneration systems to produce a certain amount of energy.Thus, CES allows estimating the carbon emission savings that are possible to achieve by a cogeneration unit, considering the combined electric and thermal efficiencies, when compared with the conventional energy production process.This index is calculated as in equation ( 11): where ɳ el,CHP is the electrical efficiency of the CHP unit, FE CO 2 ,CHP is the equivalent carbon dioxide emission factor from the fuel used by the cogeneration unit, and FE CO 2 ,CHP is the equivalent carbon dioxide emission factor from the conventional power production.The FE CO 2 ,i takes into account the specific CO 2 factor of the respective type of energy source multiplied by its fraction in the Portuguese energy mix (Y i ).Correction factors were considered in the assumption of electric grid efficiency.The ambient temperature correction was based on the difference between the annual average temperature in a Member State and standard ISO conditions (15°C).Also, 0.1% points are subtracted in the efficiency value for every degree above ISO conditions.Correction factors for avoided grid losses for the application of the harmonised efficiency reference values were also accounted for. The values obtained for CES considering different commercial systems were calculated (Table 6).Case 5, a 200 kW el gas turbine, allows a CES of 28.2%, while Case 2, a 9.5 kW el Stirling engine allows a CES of 46%.Since all the systems operate with NG as a fuel, the different  CES results are mostly related to the heat-to-power ratio of the CHP systems and their respective efficiencies.The environmental impact of switching from electricity produced with the national production mix to CHP production using NG would not be so beneficial on the electrical side since the Portuguese electricity mix does contain a fair share of wind power, hydropower and biomass.However, for combined production, there would be considerable savings due to the heat use, mostly because of the systems application scale. A graphical representation of the economic analysis can be obtained to compare the investment alternatives.Figure 4 and Figure 5 presents the variation of the NPV and IRR for Case 2 and Case 3, considering projects with different lifetime periods. Expressing economic feasibility employing costeffective indexes allows comparing different power plants types or sizes, by comparing the current value of actual or future cash flows over a given number of years at a predetermined interest rate.An investment is considered attractive if IRR is higher than the current interest rate (i.e. a rate of 7%), which takes into account the risk of the investment. According to the data from Figure 3, if the project is considered have a lifetime of least 20 years, the IRR is above 9.8%, being higher than the interest rate at which the cash flows of the project equal the investment cost.Thus, the investment costs can be recovered after 8.62 years.Differently from Case 2, the system described as Case 3 has only 15 years.For this system, the investment is clearly profitable after 6 years, because not only the investment is already recovered, but also because the IRR exceeds the interest rate of 7%.For a system lifetime of 15 years, the IRR is 15.3%. Despite the simplicity of the model herein presented, the inclusion of effective ways of quantifying the costs  and benefits and taking into account the real prices of fuel and electricity tariffs allows having an insight of the systems economic viability, even considering the full load operation of the systems.These calculating models are very useful for the diffusion of cogeneration systems when purchasing a power supply solution for buildings.This approach may be regarded as the value of reduction of the total power cost by replacing a supply power source by a cogeneration system, which can be assessed by avoidable cost methodology.",
      "entities": []
    },
    {
      "section_num": "5.2.",
      "section_name": "Sensitivity analysis",
      "text": "The model can be used to perform some sensitivity analysis on the most important parameters that can affect the economic viability.Figure 6 and Figure 7 presents analysis for the two most economic attractive cases (Case 2 (a) and Case 3(b)) in terms of NPV (assuming an interest rate of 7% for the analysis).For this sensitivity analysis, it was considered a range between 0.03 and 0.08 €/kWh for the NG price and a range of 0.06 and 0.15 €/kWh for the electricity tariff.The values of the 2D surface maps were obtained through a parametric analysis by applying the Kriging method, which is an estimation technique that provides a minimum error-variance estimate of the data.Concerning Case 2, for NG prices lower than 0.06 €/kWh, a positive value of NPV is calculated for the range of operating hours considered in the study.Regarding Case 3, only for NG prices above 0.075 €/kWh it is obtained a negative NPV for the considered range of operating hours.The results from Figure 7 show that, for both cases, the NPV is more sensitive to the feed-in-tariff than to changes in the price of the NG.It is also observed that some combinations of NG/electricity price yield a negative return. The applied tariffs, namely the price of electricity and the price of fuel, are decisive factors in determining the economic viability of the analysed systems.The remuneration schemes are an important issue when considering the economic viability of CHP units.The consideration of selling the total or partial input of the energy generated into the public service electricity network or, in opposition, the self-consumption of the energy greatly affects the cost-benefit analysis.",
      "entities": []
    },
    {
      "section_num": "6.",
      "section_name": "Conclusions and final remarks",
      "text": "A CBA analysis model was developed and applied in five case studies to assess the economic viability of different technologies.The model includes benefits such as the sale of electricity to the grid, the avoided costs from having a single system that simultaneously produces two types of useful energy and the societal benefits as a function of the primary energy savings.The costs include the expenses with the energy consumed by the system, the operational and maintenance costs.All of these terms that define the balance sheet equation have been converted into annual monetary values.According to the main results of the study it is possible to state that: • A positive CBA can be obtained considering that all the systems work at full load during 4 500 operating hours, all of them running with NG as energy source and selling the produced electricity to the grid.",
      "entities": []
    },
    {
      "section_num": null,
      "section_name": "•",
      "text": "The gas turbine (Case 5) has the best result of the CBA analysis in terms of annual profit (23 883 €/year).Nevertheless, the SenerTec GmbH motor engine (Case 3) is the cogeneration system with the highest value in terms of specific profit (477.1 €/kW el ).• For all the tested cases, the costs of the system operation exceed the profit from selling the generated electricity.Without accounting for the avoided costs and societal benefits, the CBA results would disclose unprofitable cogeneration systems.• Despite all the systems are running with NG as fuel, the 200 kW el gas turbine allows a CES of 28.2%, while the 9.5 kW el Stirling engine allows a CES of 46%.These results are due to the heatto-power ratio of each system and their respective efficiencies.",
      "entities": []
    },
    {
      "section_num": null,
      "section_name": "•",
      "text": "The application of this model allows that, with the knowledge of the specifications of a commercial system, its economic viability can be inferred, in a certain market.",
      "entities": []
    },
    {
      "section_num": null,
      "section_name": "•",
      "text": "The inclusion of societal benefits allows the integration of some externalities in the analysis.The great difficulty and limitation of the costbenefit analysis lie in the monetary valuation of all the effects associated with a decision since many of them are difficult to measure such as the social and environmental externalities.",
      "entities": []
    },
    {
      "section_num": null,
      "section_name": "•",
      "text": "The application of the model allowed the use of classic economic evaluation criteria to support the decision making on the investment, considering the Portuguese market tariffs.",
      "entities": [
        {
          "raw_entity": "Portuguese",
          "role": "Other",
          "osm_entity": "Portugal",
          "osm_link": "https://www.openstreetmap.org/relation/295480",
          "osm_id": "295480",
          "place_id": "263154752"
        }
      ]
    },
    {
      "section_num": null,
      "section_name": "•",
      "text": "Despite the simplicity of the model presented, the inclusion of effective ways of quantifying the costs and benefits and taking into account the real prices of fuel and electricity tariffs allows having an insight of the systems economic viability.Nevertheless, the model assumed that the systems operate at full load and the CBA analysis was applied considering a fixed number of operating hours, which represents a limitation of the study.",
      "entities": []
    },
    {
      "section_num": null,
      "section_name": "•",
      "text": "The sensitivity analysis allowed to conclude that the applied tariffs, namely the price of electricity and the price of fuel, are decisive factors in determining the economic viability of the analysed systems.From a wider perspective, this research allowed to conclude that a cogeneration unit with a good overall performance can lead to competitive manufacturing cost, as long as a correction is made concerning the differences in the cost of fossil fuels and of the system itself depending on the scale, the current incentives system seems to attempt to balance this aspect by favouring smaller units. From a global perspective, the investment in the improvement of the thermal envelope of buildings is more socially attractive if more efficient technologies (or even renewable energies) are used.Cogeneration technologies can take many forms and encompasses a range of technologies, but they will always be based upon an efficient, integrated system that combines electricity production and a heat recovery system.Those systems are increasingly being applied using renewable fuels, creating an important bridge to a low-carbon future.Nevertheless, there is a large difference between member states regarding the share of cogeneration in electricity generation.Europe has three countries with the most intensive cogeneration economies: Denmark, the Netherlands and Finland.In the next fifteen years, it is expected that the potential of high efficient CHP largely exceeds the current installed capacity.In addition to the large primary energy saving provided by CHP, this top efficient technology can also save up to 14 million ton CO 2 annually [62].Furthermore, it is also expected that the share of renewable sources will increase in the energy generation by CHP.Specific success factors are country or even local case-dependant.This means that an environmentally friendly orientated policy and good access to the energy infrastructure might support the integration of CHP in the energy networks.",
      "entities": [
        {
          "raw_entity": "Europe",
          "role": "Other",
          "osm_entity": "Europe",
          "osm_link": "https://www.openstreetmap.org/node/25871341",
          "osm_id": "25871341",
          "place_id": "124411950"
        },
        {
          "raw_entity": "Denmark",
          "role": "Other",
          "osm_entity": "Denmark",
          "osm_link": "https://www.openstreetmap.org/relation/50046",
          "osm_id": "50046",
          "place_id": "152522675"
        },
        {
          "raw_entity": "Netherlands",
          "role": "Other",
          "osm_entity": "Netherlands",
          "osm_link": "https://www.openstreetmap.org/relation/47796",
          "osm_id": "47796",
          "place_id": "263914038"
        },
        {
          "raw_entity": "Finland",
          "role": "Other",
          "osm_entity": "Finland",
          "osm_link": "https://www.openstreetmap.org/relation/54224",
          "osm_id": "54224",
          "place_id": "252023384"
        }
      ]
    }
  ]
}